# 재귀함수
# 내가 나를 호출하는 방법
# 반복문 <-> 재귀함수

import time

# 1부터 100까지의 합
'''
x = 0
x += 1
x += 2
x += 3
x += 4
...
x += 100
'''
# O(n)
start = time.time() # 시작 시간 저장
x = 0
n = 10000000
for i in range(1, n+1):
    x += i
print(x)
print("time: ", time.time() - start)
print('---------------------------')

# 시그마 공식: n*(n+1)//2
# O(1)
start = time.time() # 시작 시간 저장
x = 0
n = 1000000
x = n*(n+1)//2
print(x)
print("time: ", time.time() - start)
print('---------------------------')

# 1부터 100까지의 곱
'''
x = 1
x *= 1
x *= 2
x *= 3
x *= 4
...
x *= 100
'''
# 팩토리얼
# 5! = 5 * 4 * 3 * 2 * 1
x = 1
for i in range(1, 6):
    x *= i
print(x)
print('---------------------------')

def f(n):
    if n <= 1:
        return 1
    else:
        return n + f(n-1)
n = 100
print(f(n))
print('---------------------------')
'''
    f(n)    n    return     최종
1.  f(100)  100  100+f(99)  100+99+98+..+2+1=5050
2.  f(99)   99   99+f(98)   99+98+97+...+2+1=4950
3.  f(100)  98   98+f(97)   98+97+96+...+2+1=4851
4.  f(100)  97   97+f(96)   97+96+95+...+2+1=4656
5.  f(100)  96   96+f(96)   96+95+94+...+2+1=4753
... f(2)    2    2+f(1)     2+1=3
... f(1)    1    1
'''

def f1(n):
    if n <= 1:
        return 1
    else:
        return n * f1(n-1)
n = 5
print(f1(n))
'''
    f(n)    n    return     최종
1.  f(5)    5    5*f(4)     5*4*3*2*1
2.  f(99)   4    4*f(3)     4*3*2*1
3.  f(100)  3    3*f(2)     3*2*1
4.  f(100)  2    2*f(1)     2*1
5.  f(100)  1    1          1
'''